<details>
<summary>Execution result of "run --all --non-interactive --summary-per-unit --log-format bare -- plan" in "rstuhlmuller"</summary>

```terraform
INFO[0000] Unit queue will be processed for plan in this order:
- Unit github

INFO[0000] Downloading Terraform configurations from /home/runner/work/github-iac/github-iac into /home/runner/work/github-iac/github-iac/rstuhlmuller/github/.terragrunt-cache/yaliVA_3UoW_Ty9te9axdgQCRV0/9oMZMRy4aak7Al-iUlVgxcNxwWQ	 prefix=[github] 

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Installing hashicorp/aws v6.17.0 to the shared cache directory...
- Installed hashicorp/aws v6.17.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.17.0 from the shared cache directory
- Installing integrations/github v6.6.0 to the shared cache directory...
- Installed integrations/github v6.6.0 (signed, key ID 38027F80D7FD5FB2)
- Using integrations/github v6.6.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
data.aws_ssm_parameter.personal_access_token: Reading...
data.aws_ssm_parameter.personal_access_token: Read complete after 0s [id=/github-iac/personal_access_token]
github_repository.repo["terragrunt-catalog"]: Refreshing state... [id=terragrunt-catalog]
github_repository.repo["grafana-iac"]: Refreshing state... [id=grafana-iac]
github_repository.repo["personal-website"]: Refreshing state... [id=personal-website]
github_repository.repo["workflows"]: Refreshing state... [id=workflows]
github_repository.repo["octobot-deploy"]: Refreshing state... [id=octobot-deploy]
github_repository.repo["homelab"]: Refreshing state... [id=homelab]
github_repository.repo["github-iac"]: Refreshing state... [id=github-iac]
github_repository.repo["dotfiles"]: Refreshing state... [id=dotfiles]
github_repository.repo["renovate"]: Refreshing state... [id=renovate]
github_repository.repo["policies"]: Refreshing state... [id=policies]
github_repository.repo[".github"]: Refreshing state... [id=.github]
github_repository.repo["wire-pod-deploy"]: Refreshing state... [id=wire-pod-deploy]
github_repository.repo["openwebui-helm-charts"]: Refreshing state... [id=openwebui-helm-charts]
github_repository.repo["personal-website-api"]: Refreshing state... [id=personal-website-api]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # github_repository.repo["infra-tracker"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Vibe coding project for tracking infrastructure changes"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "Python"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "infra-tracker"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/homelab: 401 Bad credentials []
│ 
│   with github_repository.repo["homelab"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/policies: 401 Bad credentials []
│ 
│   with github_repository.repo["policies"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/wire-pod-deploy: 401 Bad credentials []
│ 
│   with github_repository.repo["wire-pod-deploy"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/workflows: 401 Bad credentials []
│ 
│   with github_repository.repo["workflows"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/grafana-iac: 401 Bad credentials []
│ 
│   with github_repository.repo["grafana-iac"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/dotfiles: 401 Bad credentials []
│ 
│   with github_repository.repo["dotfiles"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/.github: 401 Bad credentials []
│ 
│   with github_repository.repo[".github"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/openwebui-helm-charts: 401 Bad credentials []
│ 
│   with github_repository.repo["openwebui-helm-charts"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/personal-website: 401 Bad credentials []
│ 
│   with github_repository.repo["personal-website"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/terragrunt-catalog: 401 Bad credentials []
│ 
│   with github_repository.repo["terragrunt-catalog"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/octobot-deploy: 401 Bad credentials []
│ 
│   with github_repository.repo["octobot-deploy"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/personal-website-api: 401 Bad credentials []
│ 
│   with github_repository.repo["personal-website-api"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/renovate: 401 Bad credentials []
│ 
│   with github_repository.repo["renovate"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/rstuhlmuller/github-iac: 401 Bad credentials []
│ 
│   with github_repository.repo["github-iac"],
│   on main.tf line 23, in resource "github_repository" "repo":
│   23: resource "github_repository" "repo" {
│ 
╵
ERRO[0014] Run failed: error occurred:

* Failed to execute "tofu plan -out plan.out -input=false" in /home/runner/work/github-iac/github-iac/rstuhlmuller/github/.terragrunt-cache/yaliVA_3UoW_Ty9te9axdgQCRV0/9oMZMRy4aak7Al-iUlVgxcNxwWQ/modules/github
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/homelab: 401 Bad credentials []
  │ 
  │   with github_repository.repo["homelab"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/policies: 401 Bad credentials []
  │ 
  │   with github_repository.repo["policies"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/wire-pod-deploy: 401 Bad credentials []
  │ 
  │   with github_repository.repo["wire-pod-deploy"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/workflows: 401 Bad credentials []
  │ 
  │   with github_repository.repo["workflows"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/grafana-iac: 401 Bad credentials []
  │ 
  │   with github_repository.repo["grafana-iac"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/dotfiles: 401 Bad credentials []
  │ 
  │   with github_repository.repo["dotfiles"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/.github: 401 Bad credentials []
  │ 
  │   with github_repository.repo[".github"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/openwebui-helm-charts: 401 Bad credentials []
  │ 
  │   with github_repository.repo["openwebui-helm-charts"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/personal-website: 401 Bad credentials []
  │ 
  │   with github_repository.repo["personal-website"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/terragrunt-catalog: 401 Bad credentials []
  │ 
  │   with github_repository.repo["terragrunt-catalog"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/octobot-deploy: 401 Bad credentials []
  │ 
  │   with github_repository.repo["octobot-deploy"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/personal-website-api: 401 Bad credentials []
  │ 
  │   with github_repository.repo["personal-website-api"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/renovate: 401 Bad credentials []
  │ 
  │   with github_repository.repo["renovate"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/repos/rstuhlmuller/github-iac: 401 Bad credentials []
  │ 
  │   with github_repository.repo["github-iac"],
  │   on main.tf line 23, in resource "github_repository" "repo":
  │   23: resource "github_repository" "repo" {
  │ 
  ╵
  
  exit status 1


❯❯ Run Summary  1 units  14s
   ────────────────────────────
   Failed (1)
      github ........... 14s
```

</details>
    
